app/controllers/message_controller.rb

SELECT "messages".* FROM "messages" ORDER BY "messages"."created_at" DESC
---
  def index
    @messages = Message.all.order(created_at: :desc)

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    # find_byを用いてpostsテーブルから「params[:id]」に対応するデータを取り出し、変数@postに代入してください
    @message = Message.find_by(id:params[:id])

INSERT INTO "messages" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "テスト"], ["created_at", "2019-03-12 15:20:10.445342"], ["updated_at", "2019-03-12 15:20:10.445342"]]
---
  def create
    @message = Message.new(content:params[:content])
    @message.save

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
  def edit
    @message = Message.find_by(id:params[:id])

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "messages" SET "content" = ?, "updated_at" = ? WHERE "messages"."id" = ?  [["content", "さーな君だよ"], ["updated_at", "2019-03-16 17:14:40.833449"], ["id", 3]]
---
  def update
    @message = Message.find_by(id: params[:id])
    @message.content = params[:content]

    if @message.save

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "messages" WHERE "messages"."id" = ?  [["id", 4]]
---
  def destroy
    @message = Message.find_by(id: params[:id])
    @message.destroy